## Pandas Tutorial

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

Agenda

- What is Data Frames?
- What is Data Series?
- Different operation in Pandas

In [6]:
## First step is to import pandas

import pandas as pd
import numpy as np

In [7]:
## Playing with Dataframe

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Coumn4"])

In [8]:
df.head()

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [9]:
## Accessing the elements

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Coumn4     3
Name: Row1, dtype: int32

In [10]:
## Check the type

type(df.loc['Row1'])

pandas.core.series.Series

In [11]:
df.iloc[:,:]

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [12]:
## Take the elements from the Column2
df.iloc[1:,1:]

      Column2  Column3  Coumn4
Row2        5        6       7
Row3        9       10      11
Row4       13       14      15
Row5       17       18      19

In [13]:
#convert Dataframes into array
df.iloc[:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [14]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [74]:
df=pd.read_csv('gender_submission.csv')

In [75]:
df.head(n=16)

    PassengerId  Survived
0           892         0
1           893         1
2           894         0
3           895         0
4           896         1
5           897         0
6           898         1
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [77]:
#Pandas describe() is used to view some basic statistical details like percentile,
#mean, std etc. of a data frame or a series of numeric values.

df.describe()

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.363636
std     120.810458    0.481622
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

In [79]:
#Get the unique category counts
df['Survived'].value_counts()

0    266
1    152
Name: Survived, dtype: int64

In [81]:
df[df['PassengerId']>1300]

     PassengerId  Survived
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [82]:
df.corr()

             PassengerId  Survived
PassengerId     1.000000 -0.023245
Survived       -0.023245  1.000000

In [84]:
import numpy as np

In [85]:
lst_data=[[1,2,3],[3,4,np.nan],[5,6,np.nan],[np.nan,np.nan,np.nan]]

In [86]:
df=pd.DataFrame(lst_data)

In [87]:
df.head()

     0    1    2
0  1.0  2.0  3.0
1  3.0  4.0  NaN
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [88]:
## HAndling Missing Values

##Drop nan values

df.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [89]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [90]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],
                     columns=['one', 'two', 'three'])

In [91]:
df.head()

        one       two     three
a -0.896094 -0.951329 -0.224002
c -1.611234  0.253644  2.350918
e  0.626225  1.166054 -0.138200
f -0.104770 -0.398680  1.876759
h -0.364127  0.020892 -1.830271

In [92]:
df2=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [93]:
df2

        one       two     three
a -0.896094 -0.951329 -0.224002
b       NaN       NaN       NaN
c -1.611234  0.253644  2.350918
d       NaN       NaN       NaN
e  0.626225  1.166054 -0.138200
f -0.104770 -0.398680  1.876759
g       NaN       NaN       NaN
h -0.364127  0.020892 -1.830271

In [94]:
df2.dropna(axis=0)

        one       two     three
a -0.896094 -0.951329 -0.224002
c -1.611234  0.253644  2.350918
e  0.626225  1.166054 -0.138200
f -0.104770 -0.398680  1.876759
h -0.364127  0.020892 -1.830271

In [95]:
pd.isna(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [96]:
df2['one'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [97]:
df2.fillna('Missing')

        one       two     three
a -0.896094 -0.951329 -0.224002
b   Missing   Missing   Missing
c -1.611234  0.253644  2.350918
d   Missing   Missing   Missing
e  0.626225  1.166054   -0.1382
f  -0.10477  -0.39868  1.876759
g   Missing   Missing   Missing
h -0.364127  0.020892 -1.830271

In [98]:
df2['one'].values

array([-0.89609436,         nan, -1.61123392,         nan,  0.62622454,
       -0.10476952,         nan, -0.36412668])

In [99]:
### Reading different data sources with the help of pandas

### Read files

## CSV

In [100]:
from io import StringIO, BytesIO

In [101]:
data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [102]:
type(data)

str

In [103]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [104]:
## Read from specific columns
df=pd.read_csv(StringIO(data), usecols=lambda x: x.upper() in ['COL1', 'COL3'])
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [105]:
df.to_csv('Test.csv')

In [106]:
## Specifying columns data types

data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [107]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [108]:
df=pd.read_csv(StringIO(data),dtype=object)

In [109]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [110]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [111]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':np.float,'a':'Int64'})

In [112]:
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [113]:
df['a'][1]

5

In [114]:
## check the datatype
df.dtypes

a      Int64
b      int32
c    float64
d    float64
dtype: object

In [115]:
## Index columns and training delimiters

In [116]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [117]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [118]:
 data = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [119]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [120]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [121]:
## Combining usecols and index_col
data = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [122]:
pd.read_csv(StringIO(data), usecols=['b', 'c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [123]:
## Quoting and Escape Characters. Very useful in NLP

data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [124]:
pd.read_csv(StringIO(data),escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5

In [127]:
## URL to CSV

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [126]:
df.head()

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [ ]:
## Read Json to CSV

In [128]:
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df1=pd.read_json(Data)

In [129]:
df1

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [130]:
df1.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [131]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data', header=None)

In [132]:
df = df.head()

In [133]:
# convert Json to csv

In [134]:
df.to_csv('wine.csv')

In [135]:
# convert Json to different json formats

df.to_json(orient="values")

'[[1,14.23,1.71,2.43,15.6,127,2.8,3.06,0.28,2.29,5.64,1.04,3.92,1065],[1,13.2,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.4,1050],[1,13.16,2.36,2.67,18.6,101,2.8,3.24,0.3,2.81,5.68,1.03,3.17,1185],[1,14.37,1.95,2.5,16.8,113,3.85,3.49,0.24,2.18,7.8,0.86,3.45,1480],[1,13.24,2.59,2.87,21.0,118,2.8,2.69,0.39,1.82,4.32,1.04,2.93,735]]'

In [136]:

df.to_json(orient="records")

'[{"0":1,"1":14.23,"2":1.71,"3":2.43,"4":15.6,"5":127,"6":2.8,"7":3.06,"8":0.28,"9":2.29,"10":5.64,"11":1.04,"12":3.92,"13":1065},{"0":1,"1":13.2,"2":1.78,"3":2.14,"4":11.2,"5":100,"6":2.65,"7":2.76,"8":0.26,"9":1.28,"10":4.38,"11":1.05,"12":3.4,"13":1050},{"0":1,"1":13.16,"2":2.36,"3":2.67,"4":18.6,"5":101,"6":2.8,"7":3.24,"8":0.3,"9":2.81,"10":5.68,"11":1.03,"12":3.17,"13":1185},{"0":1,"1":14.37,"2":1.95,"3":2.5,"4":16.8,"5":113,"6":3.85,"7":3.49,"8":0.24,"9":2.18,"10":7.8,"11":0.86,"12":3.45,"13":1480},{"0":1,"1":13.24,"2":2.59,"3":2.87,"4":21.0,"5":118,"6":2.8,"7":2.69,"8":0.39,"9":1.82,"10":4.32,"11":1.04,"12":2.93,"13":735}]'

## Reading HTML content

In [137]:
html_table = """ 
<table> 
  <thead> 
    <tr> 
      <th>ID</th> 
      <th>Name</th> 
      <th>Branch</th> 
      <th>Result</th> 
    </tr> 
  </thead> 
  <tbody> 
    <tr> 
      <td>5</td> 
      <td>Patrick</td> 
      <td>Civil</td> 
      <td>Pass</td> 
    </tr> 
    <tr> 
      <td>1</td> 
      <td>Maverick</td> 
      <td>Mechanical</td> 
      <td>Fail</td> 
    </tr> 
    <tr> 
      <td>4</td> 
      <td>Peter</td> 
      <td>Computer Science</td> 
      <td>Pass</td> 
    </tr> 
    <tr> 
      <td>8</td> 
      <td>Parker</td> 
      <td>Chemical</td> 
      <td>Fail</td> 
    </tr> 
  </tbody> 
</table> 
"""  

dfs = pd.read_html(html_table)

In [138]:
dfs[0]

   ID      Name            Branch Result
0   5   Patrick             Civil   Pass
1   1  Maverick        Mechanical   Fail
2   4     Peter  Computer Science   Pass
3   8    Parker          Chemical   Fail

In [139]:
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(url_mcc, match='Country', header=0)

In [140]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

## Reading EXcel Files

In [144]:
df_excel=pd.read_excel('sheet.xlsx')

sometimes this code gives an error for xlsx files as: XLRDError:Excel xlsx file; not supported instead , you can use openpyxl engine to read excel file.

In [145]:
df_excel = pd.read_excel(r'sheet.xlsx', engine='openpyxl')

In [146]:
df_excel.head()

,Unnamed: 0,PART,PART_DESC,PROGRAM,VENDOR_ID,VENDOR_NAME,SITE,P_CODE,GSM_COMMODITY,COMMODITY_SUBGROUP,...,SITE_FLAG,PROGRAM_FLAG,P_CODE_FLAG,BUY_SELL_FLAG,PUBLISH_CHK_FLAG,DW_CREATE_TS,DW_CREATE_USER,DW_UPDATE_TS,DW_UPDATE_USER,SUPPLIER_ALLOCATION
0,0.0,452-04418,"SCREW,M1.6X0.35,FEED,X1920",J160,000049M,AMPHENOL,ALL_SITES,NaN,Enclosure - Mac,Uncategorized,...,0.0,0.0,2.0,0.0,N,2021-05-22,1.0,2021-12-14 04:02:53,1.000000e+00,0.0
1,1.0,452-04418,"SCREW,M1.6X0.35,FEED,X1920",J170,000049M,AMPHENOL,ALL_SITES,NaN,Enclosure - Mac,Uncategorized,...,0.0,0.0,2.0,0.0,N,2021-05-22,1.0,2021-12-14 04:02:53,1.000000e+00,0.0
2,2.0,514-00091,"CONN,RCPT,RJ45,X667",J137,000049M,AMPHENOL,QSMC_GRP,NaN,Connector,Connector,...,0.0,2.0,2.0,0.0,N,2020-12-06,1.0,2022-02-28 23:03:01,2.700846e+09,80.0
3,3.0,514-00167,"CONN,RCPT,MPM,X1982",J314,000049M,AMPHENOL,ALL_SITES,NaN,Connector,Connector,...,0.0,1.0,2.0,0.0,N,2021-03-27,1.0,2021-11-11 21:53:52,2.700846e+09,45.0
4,4.0,514-00167,"CONN,RCPT,MPM,X1982",J316,000049M,AMPHENOL,ALL_SITES,NaN,Connector,Connector,...,0.0,1.0,2.0,0.0,N,2021-03-27,1.0,2021-11-11 21:53:52,2.700846e+09,45.0

## Pickling
All pandas objects are equipped with to_pickle methods which use Pythons cPickle module to save data structures to disk using the pickle format.

In [147]:
df_excel.to_pickle('df_excel')

In [148]:
df=pd.read_pickle('df_excel')

In [149]:
df.head()

,Unnamed: 0,PART,PART_DESC,PROGRAM,VENDOR_ID,VENDOR_NAME,SITE,P_CODE,GSM_COMMODITY,COMMODITY_SUBGROUP,...,SITE_FLAG,PROGRAM_FLAG,P_CODE_FLAG,BUY_SELL_FLAG,PUBLISH_CHK_FLAG,DW_CREATE_TS,DW_CREATE_USER,DW_UPDATE_TS,DW_UPDATE_USER,SUPPLIER_ALLOCATION
0,0.0,452-04418,"SCREW,M1.6X0.35,FEED,X1920",J160,000049M,AMPHENOL,ALL_SITES,NaN,Enclosure - Mac,Uncategorized,...,0.0,0.0,2.0,0.0,N,2021-05-22,1.0,2021-12-14 04:02:53,1.000000e+00,0.0
1,1.0,452-04418,"SCREW,M1.6X0.35,FEED,X1920",J170,000049M,AMPHENOL,ALL_SITES,NaN,Enclosure - Mac,Uncategorized,...,0.0,0.0,2.0,0.0,N,2021-05-22,1.0,2021-12-14 04:02:53,1.000000e+00,0.0
2,2.0,514-00091,"CONN,RCPT,RJ45,X667",J137,000049M,AMPHENOL,QSMC_GRP,NaN,Connector,Connector,...,0.0,2.0,2.0,0.0,N,2020-12-06,1.0,2022-02-28 23:03:01,2.700846e+09,80.0
3,3.0,514-00167,"CONN,RCPT,MPM,X1982",J314,000049M,AMPHENOL,ALL_SITES,NaN,Connector,Connector,...,0.0,1.0,2.0,0.0,N,2021-03-27,1.0,2021-11-11 21:53:52,2.700846e+09,45.0
4,4.0,514-00167,"CONN,RCPT,MPM,X1982",J316,000049M,AMPHENOL,ALL_SITES,NaN,Connector,Connector,...,0.0,1.0,2.0,0.0,N,2021-03-27,1.0,2021-11-11 21:53:52,2.700846e+09,45.0

### Merge, join, concatenate and compare

In [150]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [151]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [155]:
# concat 3 data frames
result = pd.concat([df1,df2,df3])

In [154]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [157]:
# concat 3 data frames 
result = pd.concat([df1,df2,df3],axis=1)
result

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### for more about concate, compare
https://pandas.pydata.org/docs/user_guide/merging.html

### Database-style DataFrame or named Series joining/merging
`pandas provides a single function, merge(), as the entry point for all standard database join operations between DataFrame or named Series objects:`

# pd.merge(
    left, # A DataFrame or named Series object.
    right, # another DataFrame or named Series object.
    how="inner",  #One of 'left', 'right', 'outer', 'inner', 'cross'. Defaults to inner. See below for more detailed description of each method.
    
    on=None, # on: Column or index level names to join on. Must be found in both the left and right DataFrame and/or Series objects. If not passed and left_index and right_index are False, the intersection of the columns in the DataFrames and/or Series will be inferred to be the join keys.
    
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=True,
    suffixes=("_x", "_y"),
    copy=True,
    indicator=False,
    validate=None,
)

In [160]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)


result = pd.merge(left, right, on="key")
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### more in 
https://pandas.pydata.org/docs/user_guide/merging.html#database-style-dataframe-or-named-series-joining-merging

In [161]:
### compare dfs

In [164]:
df1=pd.DataFrame([[1,2],[3,4],[5,6],[7,8]],columns=['a1','a2'])

In [165]:
df2 = pd.DataFrame([[11,2],[3,33],[55,6],[7,88]],columns=['a1','a2'])

In [169]:
df1.compare(df2)

    a1         a2
  self other self other
0  1.0  11.0  NaN   NaN
1  NaN   NaN  4.0  33.0
2  5.0  55.0  NaN   NaN
3  NaN   NaN  8.0  88.0

In [178]:
# align_axis : {0 or 'index', 1 or 'columns'}, default 1
# Determine which axis to align the comparison on.
df1.compare(df2,align_axis=False)

           a1    a2
0 self    1.0   NaN
  other  11.0   NaN
1 self    NaN   4.0
  other   NaN  33.0
2 self    5.0   NaN
  other  55.0   NaN
3 self    NaN   8.0
  other   NaN  88.0

In [174]:
#If true, all rows and columns are kept.
#Otherwise, only the ones with different values are kept.
df1.compare(df2,keep_shape=True)

    a1         a2
  self other self other
0  1.0  11.0  NaN   NaN
1  NaN   NaN  4.0  33.0
2  5.0  55.0  NaN   NaN
3  NaN   NaN  8.0  88.0

In [179]:
#If true, the result keeps values that are equal.
#Otherwise, equal values are shown as NaNs.

In [180]:
df1.compare(df2,keep_equal=True)

    a1         a2
  self other self other
0    1    11    2     2
1    3     3    4    33
2    5    55    6     6
3    7     7    8    88